# Optional Exercises
Here you can find the optional exercises for this week. As always we are going to share the solutions in the __flipped classroom__
<img src="pictures/optex1.png" width="150" style="float: right;"/>

<a id='exe01'></a>
### Exercise 1 - categorical data
In the titanic data set there is another column for which it makes sense to convert the numerical entries into categorical data. This is the column `fare`. 
Have a look at the head of the column and decide for meaningful bins (can be any bins and as many as you want, just think of a reason why you split into these categories.)

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

In [4]:
titanic_data = titanic = sns.load_dataset('titanic')
titanic_data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# your code

<a id='exe02'></a>
### Exercise 2 - merging dataframes
Perform an inner and an outer join on these two dataframes as well as a join where only the overlapping animal names are joined.

In [7]:
df1 = pd.DataFrame({'A': [1, 2, 3, 4, 5],
                    'B': [0, np.pi, 2 * np.pi, 3 * np.pi, 4 * np.pi],
                    'C': ['mouse', 'cat', 'dog', 'fish', 'horse']})

df2 = pd.DataFrame({'C': ['mouse', 'horse', 'lizard', 'fish', 'coyote'],
                    'D': [1.0, 1.7, 3.0, 2.1, 3.3],
                    'E': [1, np.e, np.e ** 2, np.e ** 3, np.e ** 4]})

In [8]:
df1

   A          B      C
0  1   0.000000  mouse
1  2   3.141593    cat
2  3   6.283185    dog
3  4   9.424778   fish
4  5  12.566371  horse

In [9]:
df2

        C    D          E
0   mouse  1.0   1.000000
1   horse  1.7   2.718282
2  lizard  3.0   7.389056
3    fish  2.1  20.085537
4  coyote  3.3  54.598150

In [ ]:
# inner join

In [ ]:
# outer join

In [ ]:
# joining overlapping columns (on animal names)

<a id='exe03'></a>
### Exercise 3 - timeseries data
Create a dataframe with the the following infromation about the scipy course:
- day week of publishing the content as index
- name of the lecture
- name of the homework

In [ ]:
# your code

<a id='exe04'></a>
### Exercise 4 - cleaning data
Clean the titanic.csv dataset by:
- droping the missing values
- removing the dublicates

In [ ]:
# your code